
[

    
    {
        "title": "My Google Code-in experience with JBoss",
        "content": "This is my first GCI. I’m a teen from India who is a Graphics Designer. I got to know about this competition from my schoolmates. It’s been about 10 days and I’ve completed around 10 tasks. I’d a pretty slow start but then I caught up my pace. The real difficulty with this competition is that it’s around the time of my examinations. It’s a quite tough task to do both GCI &amp; exams and sometimes the time “equilibrium” for both is not maintained. My biggest fear in this event is to abandon a task and feel gloomy about it. Right now I’m completing all the “User interface” tasks and some basic coding tasks as well. The overall spirit amongst us is high and I hope I get the chance to achieve something huge in my life !\n\nWhat have I gained ?\n\n\n  The GCI t-shirt (jk)\n  Experience about professionalism\n  The experience of meeting fellow participants around the globe\n  The mentorship given by our great mentors\n  The chance to see where I stand amongst others\n\n\nI hope my contributions to Open Source would help this community.\n",
        "link": "/2017/gcitask-sid",
        "date": "2017-12-07 00:00:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "Code-In Is Awesome",
        "content": "It has been a week since I participated in Google Code-In as a 11th-grade, and I have to say that THIS IS AWESOME.\n\nI encountered coding at about 7th grade and was highly impressed by the amaze of making dead things alive with simple instructions. Til now I’ve made some little progress on a handful small projects built for myself, yet contributing to the open source world and collaborating with other devs is something I never did before until I get to know GCI by a lucky chance, and that is full of fun and EXCITEMENT.\n\nIt has been a great time working with JBoss Community which is actually the most popular org in GCI currently XD. Competing with other passionate contestants while working with them at the same time is really challenging yet fascinating. Even though there’re some technologies I’m not good at or haven’t encountered before, contributing to the construction of those project with what I know and what I’m capable of gives me unprecedented satisfactions.\n\nWish I have a good time seeing billions of my tasks got approved XD.\n",
        "link": "/2017/anhai-wang",
        "date": "2017-12-07 00:00:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "My Google Code-In Experience",
        "content": "It’s been more than an hour and I haven’t moved an inch. My brother has made several attempts to try to get me to look at him, but I don’t budge. This is time for concentration.\n\nThis is what happens to me when I am engrossed in any task. And Google Code In has done just that. It has only been about 2 days since it started, but ever since then, every spare moment I have had the privilege of experiencing is spent browsing the GCI Home page for new tasks or hoping for approval on my current tasks.\n\nI find programming to be a fascinating subject, and want to pursue a career in this field. I am absolutely certain that Google Code In and JBoss, the organisation that the majority of my tasks belong to, will help me make this dream a reality.\n",
        "link": "/2017/sachinrammoorthyblog",
        "date": "2017-12-06 00:00:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "My GCI Experience",
        "content": "My Experience at Google Code In 2017\n\nThe concept of competitive programming had been relatively new to me until I heard of Google Code In and Code Jam. I decided to have a go at 2017’s Code In, expecting a new and fun-filled experience. And I sure wasn’t disappointed.\n\nI was waiting for the opening of registrations on November 28, refreshing the page every five seconds to check if the contest had begun yet. And finally, three minutes past the scheduled time, I was able to register. The tasks page had an unending number of challenging tasks, and I was tempted to claim each and every one of them. Being a first time participant, I didn’t know that only one task could be claimed at a time. The task I chose first was a UI design one, as UI development and coding were among my favourite categories. Unfortunately, I couldn’t complete the task, and had to abandon it.\n\nLater, I continued checking out other tasks, and claimed a logo design task by JBoss Community. It got approved, and that was a major boost in my confidence. Since then, I have claimed many UI/coding tasks, and I have been enjoying completing all of them.\n\nWhat I gained at GCI 2017\n\n  I could acquire a very specific skill set required to complete tasks.\n  Meeting people around the world was a delight, as I could learn a lot of things from them.\n  The mentors were helpful, and were more like peers who would patiently talk to us and help solve our issues.\n\n\nIn short, GCI was a sweet and extravagant event for me, and it has been more of a learning experience than a competiton, and has helped me witness the true power of open source.\n\nI’m surely participating every year from now on!\n",
        "link": "/2017/blog-post",
        "date": "2017-12-06 00:00:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "Contributing to Open Source",
        "content": "Contributing to open source can be exciting as well as scary at the same time. If you are a newbie, then entering into the world of open source can be a really overwhelming experience for sure.\n\nThe term “open source” refers to something people can modify and share because its design is publicly accessible. Open source software is software developed by and for the user community. If you want to contribute to open source projects then GitHub is the next thing you need to be familiar with.\n\n\n\nFor contributing to open source, you don’t need to be a developer. A non-programmer can also do a variety of stuffs like documentation , designing and suggesting features.\n\nDocumentation plays a vital role in understanding of the project. Every project repository in GitHub comes with a README file stating how to use the project and how to set up the environment for running it.\n\nHow to contribute to open source?\n\n  Choose a project meeting your requirement and skill set.\n  Pick an issue to work upon or raise an issue if you find some bug in the project\n  After fixing the problem highlighted in the issue, open a pull request for it.\n  If your pull request need to be worked on further, then it’s  better to write WIP [work in progress]\n  Try following the guidelines while submitting a patch\n\n\nEasy! Isn’t it?\nAfter following these  little steps, you can congratulate yourself. You have now contributed to open source which felt terrifying in the beginning.\n\nThis is an amazing experience to get to know that a project you worked on is now being used by millions of users. Moreover, you get a chance to interact with other people of your domain. You can learn from them and improve to an extend you have not anticipated. So get , set and start contributing!!\n",
        "link": "/2017/contributing-to-open-source",
        "date": "2017-12-01 00:00:00 +0000",
        "excerpt": "",
        "search_omit": ""
    }
    
    



    
    ,{
        "title": "Page not found",
        "content": "Sorry, the requested page wasn’t found on the server.\n",
        "link": "/404.html",
        "date": null,
        "excerpt": null,
        "search_omit": ""
    }
    
    

    
    ,{
        "title": "About JBoss Community",
        "content": "JBoss Community  is a community of open source projects\n\nThe community hosts a large number of projects that are written in various programming languages. The primary language is Java. But there are also projects that are written in Ruby, PHP, Node and other languages.\n",
        "link": "/about/",
        "date": null,
        "excerpt": null,
        "search_omit": ""
    }
    
    

    

    

    
    ,{
        "title": "Search",
        "content": "\n\n  \n\n    Search\n\n    \n    \n      \n      \n    \n\n  \n\n\n\n\n  \n  \n\n  \n  \n\n\n",
        "link": "/search/",
        "date": null,
        "excerpt": null,
        "search_omit": "true"
    }
    
    

    

    

    

    

]
